##############################################################
##         Initial Encounter Configuration                  ##
## Script Generated for Undergrad class of microelectronics ##
## Generated by Matheus Moreira - 9/11/2011                 ##
## GAPH/FACIN/PUCRS                                         ##
##                                                          ##
## Functionalities of this script:                          ##
##  -Export design netlist to verilog                       ##
##  -Annotate the delay of the final design                 ##
##############################################################
##Export design netlist
saveNetlist Mult_CSAdder.v
##Annotate design delay
extractRC -outfile Mult_CSAdder.cap
clearClockDomains
setClockDomains -all
timeDesign -postRoute -pathReports -drvReports -slackReports -numPaths 50 -prefix Mult_CSAdder_postRoute -outDir timingReports
write_sdf -ideal_clock_network Mult_CSAdder.sdf
