##############################################################
##         Initial Encounter Configuration                  ##
## Script Generated for Undergrad class of microelectronics ##
## Generated by Matheus Moreira - 9/11/2011                 ##
## GAPH/FACIN/PUCRS                                         ##
##                                                          ##
## Functionalities of this script:                          ##
##  -Place standard cells                                   ##
##  -Place core pins                                        ##
##  -Perform initial route of the design                    ##
##############################################################
##Place the design
setPlaceMode -fp false
placeDesign -prePlaceOpt
setDrawView place
##Place pins in left and right margins
editPin -side Left -pinWidth 0.1 -pinDepth 0.52 -layer 3 -spreadType side -pin {{B[0]} {B[1]} {B[2]} {B[3]} {A[0]} {A[1]} {A[2]} {A[3]}}
editPin -side Right -pinWidth 0.1 -pinDepth 0.52 -layer 3 -spreadType side -pin {{P[0]} {P[1]} {P[2]} {P[3]} {P[4]} {P[5]} {P[6]} {P[7]}}
##Initial route of the design
trialRoute -maxRouteLayer 8
